apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-int.h
#define PIC32MZ_INT_IEC_OFFSET(n)     (0x00c0 + ((n) << 4))
#define PIC32MZ_INT_IECCLR_OFFSET(n)  (0x00c4 + ((n) << 4))
#define PIC32MZ_INT_IECSET_OFFSET(n)  (0x00c8 + ((n) << 4))
#define PIC32MZ_INT_IECINV_OFFSET(n)  (0x00cc + ((n) << 4))

#define PIC32MZ_INT_IEC0_OFFSET       0x00c0 /* Interrupt enable control register 0 */
#define PIC32MZ_INT_IEC0CLR_OFFSET    0x00c4 /* Interrupt enable control clear register 0 */
#define PIC32MZ_INT_IEC0SET_OFFSET    0x00c8 /* Interrupt enable control set register 0 */
#define PIC32MZ_INT_IEC0INV_OFFSET    0x00cc /* Interrupt enable control invert register 0 */

#define PIC32MZ_INT_IEC1_OFFSET       0x00d0 /* Interrupt enable control register 1 */
#define PIC32MZ_INT_IEC1CLR_OFFSET    0x00d4 /* Interrupt enable control clear register 1 */
#define PIC32MZ_INT_IEC1SET_OFFSET    0x00d8 /* Interrupt enable control set register 1 */
#define PIC32MZ_INT_IEC1INV_OFFSET    0x00dc /* Interrupt enable control invert register 1 */

#define PIC32MZ_INT_IEC2_OFFSET       0x00e0 /* Interrupt enable control register 2 */
#define PIC32MZ_INT_IEC2CLR_OFFSET    0x00e4 /* Interrupt enable control clear register 2 */
#define PIC32MZ_INT_IEC2SET_OFFSET    0x00e8 /* Interrupt enable control set register 2 */
#define PIC32MZ_INT_IEC2INV_OFFSET    0x00ec /* Interrupt enable control invert register 2 */

#define PIC32MZ_INT_IEC3_OFFSET       0x00f0 /* Interrupt enable control register 3 */
#define PIC32MZ_INT_IEC3CLR_OFFSET    0x00f4 /* Interrupt enable control clear register 3 */
#define PIC32MZ_INT_IEC3SET_OFFSET    0x00f8 /* Interrupt enable control set register 3 */
#define PIC32MZ_INT_IEC3INV_OFFSET    0x00fc /* Interrupt enable control invert register 3 */

#define PIC32MZ_INT_IEC4_OFFSET       0x0100 /* Interrupt enable control register 4 */
#define PIC32MZ_INT_IEC4CLR_OFFSET    0x0104 /* Interrupt enable control clear register 4 */
#define PIC32MZ_INT_IEC4SET_OFFSET    0x0108 /* Interrupt enable control set register 4 */
#define PIC32MZ_INT_IEC4INV_OFFSET    0x010c /* Interrupt enable control invert register 4 */

#define PIC32MZ_INT_IEC5_OFFSET       0x0110 /* Interrupt enable control register 5 */
#define PIC32MZ_INT_IEC5CLR_OFFSET    0x0114 /* Interrupt enable control clear register 5 */
#define PIC32MZ_INT_IEC5SET_OFFSET    0x0118 /* Interrupt enable control set register 5 */
#define PIC32MZ_INT_IEC5INV_OFFSET    0x011c /* Interrupt enable control invert register 5 */

#define PIC32MZ_INT_IPC_OFFSET(n)     (0x0140 + ((n) << 4))
#define PIC32MZ_INT_IPCCLR_OFFSET(n)  (0x0144 + ((n) << 4))
#define PIC32MZ_INT_IPCSET_OFFSET(n)  (0x0148 + ((n) << 4))
#define PIC32MZ_INT_IPCINV_OFFSET(n)  (0x014c + ((n) << 4))

#define PIC32MZ_INT_IPC0_OFFSET       0x0140 /* Interrupt priority control register 0 */
#define PIC32MZ_INT_IPC0CLR_OFFSET    0x0144 /* Interrupt priority control clear register 0 */
#define PIC32MZ_INT_IPC0SET_OFFSET    0x0148 /* Interrupt priority control set register 0 */
#define PIC32MZ_INT_IPC0INV_OFFSET    0x014c /* Interrupt priority control invert register 0 */

#define PIC32MZ_INT_IPC1_OFFSET       0x0150 /* Interrupt priority control register 1 */
#define PIC32MZ_INT_IPC1CLR_OFFSET    0x0154 /* Interrupt priority control clear register 1 */
#define PIC32MZ_INT_IPC1SET_OFFSET    0x0158 /* Interrupt priority control set register 1 */
#define PIC32MZ_INT_IPC1INV_OFFSET    0x015c /* Interrupt priority control invert register 1 */

#define PIC32MZ_INT_IPC2_OFFSET       0x0160 /* Interrupt priority control register 2 */
#define PIC32MZ_INT_IPC2CLR_OFFSET    0x0164 /* Interrupt priority control clear register 2 */
#define PIC32MZ_INT_IPC2SET_OFFSET    0x0168 /* Interrupt priority control set register 2 */
#define PIC32MZ_INT_IPC2INV_OFFSET    0x016c /* Interrupt priority control invert register 2 */

#define PIC32MZ_INT_IPC3_OFFSET       0x0170 /* Interrupt priority control register 3 */
#define PIC32MZ_INT_IPC3CLR_OFFSET    0x0174 /* Interrupt priority control clear register 3 */
#define PIC32MZ_INT_IPC3SET_OFFSET    0x0178 /* Interrupt priority control set register 3 */
#define PIC32MZ_INT_IPC3INV_OFFSET    0x017c /* Interrupt priority control invert register 3 */

#define PIC32MZ_INT_IPC4_OFFSET       0x0180 /* Interrupt priority control register 4 */
#define PIC32MZ_INT_IPC4CLR_OFFSET    0x0184 /* Interrupt priority control clear register 4 */
#define PIC32MZ_INT_IPC4SET_OFFSET    0x0188 /* Interrupt priority control set register 4 */
#define PIC32MZ_INT_IPC4INV_OFFSET    0x018c /* Interrupt priority control invert register 4 */

#define PIC32MZ_INT_IPC5_OFFSET       0x0190 /* Interrupt priority control register 5 */
#define PIC32MZ_INT_IPC5CLR_OFFSET    0x0194 /* Interrupt priority control clear register 5 */
#define PIC32MZ_INT_IPC5SET_OFFSET    0x0198 /* Interrupt priority control set register 5 */
#define PIC32MZ_INT_IPC5INV_OFFSET    0x019c /* Interrupt priority control invert register 5 */

#define PIC32MZ_INT_IPC6_OFFSET       0x01a0 /* Interrupt priority control register 6 */
#define PIC32MZ_INT_IPC6CLR_OFFSET    0x01a4 /* Interrupt priority control clear register 6 */
#define PIC32MZ_INT_IPC6SET_OFFSET    0x01a8 /* Interrupt priority control set register 6 */
#define PIC32MZ_INT_IPC6INV_OFFSET    0x01ac /* Interrupt priority control invert register 6 */

#define PIC32MZ_INT_IPC7_OFFSET       0x01b0 /* Interrupt priority control register 7 */
#define PIC32MZ_INT_IPC7CLR_OFFSET    0x01b4 /* Interrupt priority control clear register 7 */
#define PIC32MZ_INT_IPC7SET_OFFSET    0x01b8 /* Interrupt priority control set register 7 */
#define PIC32MZ_INT_IPC7INV_OFFSET    0x01bc /* Interrupt priority control invert register 7 */

#define PIC32MZ_INT_IPC8_OFFSET       0x01c0 /* Interrupt priority control register 8 */
#define PIC32MZ_INT_IPC8CLR_OFFSET    0x01c4 /* Interrupt priority control clear register 8 */
#define PIC32MZ_INT_IPC8SET_OFFSET    0x01c8 /* Interrupt priority control set register 8 */
#define PIC32MZ_INT_IPC8INV_OFFSET    0x01cc /* Interrupt priority control invert register 8 */

#define PIC32MZ_INT_IPC9_OFFSET       0x01d0 /* Interrupt priority control register 9 */
#define PIC32MZ_INT_IPC9CLR_OFFSET    0x01d4 /* Interrupt priority control clear register 9 */
#define PIC32MZ_INT_IPC9SET_OFFSET    0x01d8 /* Interrupt priority control set register 9 */
#define PIC32MZ_INT_IPC9INV_OFFSET    0x01dc /* Interrupt priority control invert register 9 */

