apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-int.h
#define PIC32MZ_INT_IPC10_OFFSET      0x01e0 /* Interrupt priority control register 10 */
#define PIC32MZ_INT_IPC10CLR_OFFSET   0x01e4 /* Interrupt priority control clear register 10 */
#define PIC32MZ_INT_IPC10SET_OFFSET   0x01e8 /* Interrupt priority control set register 10 */
#define PIC32MZ_INT_IPC10INV_OFFSET   0x01ec /* Interrupt priority control invert register 10 */

#define PIC32MZ_INT_IPC11_OFFSET      0x01f0 /* Interrupt priority control register 11 */
#define PIC32MZ_INT_IPC11CLR_OFFSET   0x01f4 /* Interrupt priority control clear register 11 */
#define PIC32MZ_INT_IPC11SET_OFFSET   0x01f8 /* Interrupt priority control set register 11 */
#define PIC32MZ_INT_IPC11INV_OFFSET   0x01fc /* Interrupt priority control invert register 11 */

#define PIC32MZ_INT_IPC12_OFFSET      0x0200 /* Interrupt priority control register 12 */
#define PIC32MZ_INT_IPC12CLR_OFFSET   0x0204 /* Interrupt priority control clear register 12 */
#define PIC32MZ_INT_IPC12SET_OFFSET   0x0208 /* Interrupt priority control set register 12 */
#define PIC32MZ_INT_IPC12INV_OFFSET   0x020c /* Interrupt priority control invert register 12 */

#define PIC32MZ_INT_IPC13_OFFSET      0x0210 /* Interrupt priority control register 13 */
#define PIC32MZ_INT_IPC13CLR_OFFSET   0x0214 /* Interrupt priority control clear register 13 */
#define PIC32MZ_INT_IPC13SET_OFFSET   0x0218 /* Interrupt priority control set register 13 */
#define PIC32MZ_INT_IPC13INV_OFFSET   0x021c /* Interrupt priority control invert register 13 */

#define PIC32MZ_INT_IPC14_OFFSET      0x0220 /* Interrupt priority control register 14 */
#define PIC32MZ_INT_IPC14CLR_OFFSET   0x0224 /* Interrupt priority control clear register 14 */
#define PIC32MZ_INT_IPC14SET_OFFSET   0x0228 /* Interrupt priority control set register 14 */
#define PIC32MZ_INT_IPC14INV_OFFSET   0x022c /* Interrupt priority control invert register 14 */

#define PIC32MZ_INT_IPC15_OFFSET      0x0230 /* Interrupt priority control register 15 */
#define PIC32MZ_INT_IPC15CLR_OFFSET   0x0234 /* Interrupt priority control clear register 15 */
#define PIC32MZ_INT_IPC15SET_OFFSET   0x0238 /* Interrupt priority control set register 15 */
#define PIC32MZ_INT_IPC15INV_OFFSET   0x023c /* Interrupt priority control invert register 15 */

#define PIC32MZ_INT_IPC16_OFFSET      0x0240 /* Interrupt priority control register 16 */
#define PIC32MZ_INT_IPC16CLR_OFFSET   0x0244 /* Interrupt priority control clear register 16 */
#define PIC32MZ_INT_IPC16SET_OFFSET   0x0248 /* Interrupt priority control set register 16 */
#define PIC32MZ_INT_IPC16INV_OFFSET   0x024c /* Interrupt priority control invert register 16 */

#define PIC32MZ_INT_IPC17_OFFSET      0x0250 /* Interrupt priority control register 17 */
#define PIC32MZ_INT_IPC17CLR_OFFSET   0x0254 /* Interrupt priority control clear register 17 */
#define PIC32MZ_INT_IPC17SET_OFFSET   0x0258 /* Interrupt priority control set register 17 */
#define PIC32MZ_INT_IPC17INV_OFFSET   0x025c /* Interrupt priority control invert register 17 */

#define PIC32MZ_INT_IPC18_OFFSET      0x0260 /* Interrupt priority control register 18 */
#define PIC32MZ_INT_IPC18CLR_OFFSET   0x0264 /* Interrupt priority control clear register 18 */
#define PIC32MZ_INT_IPC18SET_OFFSET   0x0268 /* Interrupt priority control set register 18 */
#define PIC32MZ_INT_IPC18INV_OFFSET   0x026c /* Interrupt priority control invert register 18 */

#define PIC32MZ_INT_IPC19_OFFSET      0x0270 /* Interrupt priority control register 19 */
#define PIC32MZ_INT_IPC19CLR_OFFSET   0x0274 /* Interrupt priority control clear register 19 */
#define PIC32MZ_INT_IPC19SET_OFFSET   0x0278 /* Interrupt priority control set register 19 */
#define PIC32MZ_INT_IPC19INV_OFFSET   0x027c /* Interrupt priority control invert register 19 */

#define PIC32MZ_INT_IPC20_OFFSET      0x0280 /* Interrupt priority control register 20 */
#define PIC32MZ_INT_IPC20CLR_OFFSET   0x0284 /* Interrupt priority control clear register 20 */
#define PIC32MZ_INT_IPC20SET_OFFSET   0x0288 /* Interrupt priority control set register 20 */
#define PIC32MZ_INT_IPC20INV_OFFSET   0x028c /* Interrupt priority control invert register 20 */

#define PIC32MZ_INT_IPC21_OFFSET      0x0290 /* Interrupt priority control register 21 */
#define PIC32MZ_INT_IPC21CLR_OFFSET   0x0294 /* Interrupt priority control clear register 21 */
#define PIC32MZ_INT_IPC21SET_OFFSET   0x0298 /* Interrupt priority control set register 21 */
#define PIC32MZ_INT_IPC21INV_OFFSET   0x029c /* Interrupt priority control invert register 21 */

#define PIC32MZ_INT_IPC22_OFFSET      0x02a0 /* Interrupt priority control register 22 */
#define PIC32MZ_INT_IPC22CLR_OFFSET   0x02a4 /* Interrupt priority control clear register 22 */
#define PIC32MZ_INT_IPC22SET_OFFSET   0x02a8 /* Interrupt priority control set register 22 */
#define PIC32MZ_INT_IPC22INV_OFFSET   0x02ac /* Interrupt priority control invert register 22 */

#define PIC32MZ_INT_IPC23_OFFSET      0x02b0 /* Interrupt priority control register 23 */
#define PIC32MZ_INT_IPC23CLR_OFFSET   0x02b4 /* Interrupt priority control clear register 23 */
#define PIC32MZ_INT_IPC23SET_OFFSET   0x02b8 /* Interrupt priority control set register 23 */
#define PIC32MZ_INT_IPC23INV_OFFSET   0x02bc /* Interrupt priority control invert register 23 */

#define PIC32MZ_INT_IPC24_OFFSET      0x02c0 /* Interrupt priority control register 24 */
#define PIC32MZ_INT_IPC24CLR_OFFSET   0x02c4 /* Interrupt priority control clear register 24 */
#define PIC32MZ_INT_IPC24SET_OFFSET   0x02c8 /* Interrupt priority control set register 24 */
#define PIC32MZ_INT_IPC24INV_OFFSET   0x02cc /* Interrupt priority control invert register 24 */

#define PIC32MZ_INT_IPC25_OFFSET      0x02d0 /* Interrupt priority control register 25 */
#define PIC32MZ_INT_IPC25CLR_OFFSET   0x02d4 /* Interrupt priority control clear register 25 */
#define PIC32MZ_INT_IPC25SET_OFFSET   0x02d8 /* Interrupt priority control set register 25 */
#define PIC32MZ_INT_IPC25INV_OFFSET   0x02dc /* Interrupt priority control invert register 25 */

#define PIC32MZ_INT_IPC26_OFFSET      0x02e0 /* Interrupt priority control register 26 */
#define PIC32MZ_INT_IPC26CLR_OFFSET   0x02e4 /* Interrupt priority control clear register 26 */
#define PIC32MZ_INT_IPC26SET_OFFSET   0x02e8 /* Interrupt priority control set register 26 */
#define PIC32MZ_INT_IPC26INV_OFFSET   0x02ec /* Interrupt priority control invert register 26 */

#define PIC32MZ_INT_IPC27_OFFSET      0x02f0 /* Interrupt priority control register 27 */
#define PIC32MZ_INT_IPC27CLR_OFFSET   0x02f4 /* Interrupt priority control clear register 27 */
#define PIC32MZ_INT_IPC27SET_OFFSET   0x02f8 /* Interrupt priority control set register 27 */
#define PIC32MZ_INT_IPC27INV_OFFSET   0x02fc /* Interrupt priority control invert register 27 */

#define PIC32MZ_INT_IPC28_OFFSET      0x0300 /* Interrupt priority control register 28 */
#define PIC32MZ_INT_IPC28CLR_OFFSET   0x0304 /* Interrupt priority control clear register 28 */
#define PIC32MZ_INT_IPC28SET_OFFSET   0x0308 /* Interrupt priority control set register 28 */
#define PIC32MZ_INT_IPC28INV_OFFSET   0x030c /* Interrupt priority control invert register 28 */

#define PIC32MZ_INT_IPC29_OFFSET      0x0310 /* Interrupt priority control register 29 */
#define PIC32MZ_INT_IPC29CLR_OFFSET   0x0314 /* Interrupt priority control clear register 29 */
#define PIC32MZ_INT_IPC29SET_OFFSET   0x0318 /* Interrupt priority control set register 29 */
#define PIC32MZ_INT_IPC29INV_OFFSET   0x031c /* Interrupt priority control invert register 29 */

#define PIC32MZ_INT_IPC30_OFFSET      0x0320 /* Interrupt priority control register 30 */
#define PIC32MZ_INT_IPC30CLR_OFFSET   0x0324 /* Interrupt priority control clear register 30 */
#define PIC32MZ_INT_IPC30SET_OFFSET   0x0328 /* Interrupt priority control set register 30 */
#define PIC32MZ_INT_IPC30INV_OFFSET   0x032c /* Interrupt priority control invert register 30 */

#define PIC32MZ_INT_IPC31_OFFSET      0x0330 /* Interrupt priority control register 31 */
#define PIC32MZ_INT_IPC31CLR_OFFSET   0x0334 /* Interrupt priority control clear register 31 */
#define PIC32MZ_INT_IPC31SET_OFFSET   0x0338 /* Interrupt priority control set register 31 */
#define PIC32MZ_INT_IPC31INV_OFFSET   0x033c /* Interrupt priority control invert register 31 */

